```Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

aws_iam_instance_profile.kms_profile: Refreshing state... [id=kms_profile]
aws_vpc.vpc: Refreshing state... [id=vpc-0a62c044ea3ac6c9b]
aws_subnet.subnet_public: Refreshing state... [id=subnet-00e90350bca1b0ff4]
aws_default_route_table.default_rt: Refreshing state... [id=rtb-02f587ef284db7a10]
aws_internet_gateway.igw: Refreshing state... [id=igw-088729d1f9ea1e2de]
aws_subnet.subnet_private: Refreshing state... [id=subnet-0f13ea06e1444ffad]
aws_security_group.sgpublic: Refreshing state... [id=sg-00d9b79fcacc82970]
aws_security_group.sgprivate: Refreshing state... [id=sg-0babf07850f0bbeb5]
aws_route_table.rtb_public: Refreshing state... [id=rtb-0be5c0eabf537b53a]
aws_route_table_association.rta_subnet_private: Refreshing state... [id=rtbassoc-0cfdd2b792bca2421]
aws_instance.privateInstance: Refreshing state... [id=i-0a2b7d1281067ad5a]
aws_instance.publicInstance1: Refreshing state... [id=i-0eb2ff11867faea48]
aws_instance.publicInstance2: Refreshing state... [id=i-042560147300b9a77]
aws_vpc_endpoint.kms: Refreshing state... [id=vpce-0e2229b190103dca9]
aws_route_table_association.rta_subnet_public: Refreshing state... [id=rtbassoc-006100b9f0e4bff3e]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route_table.rtb_public will be created
  + resource "aws_route_table" "rtb_public" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = "igw-088729d1f9ea1e2de"
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Environment" = "PegaKMSDemo"
          + "Name"        = "public-router"
        }
      + vpc_id           = "vpc-0a62c044ea3ac6c9b"
    }

  # aws_route_table_association.rta_subnet_private will be created
  + resource "aws_route_table_association" "rta_subnet_private" {
      + id             = (known after apply)
      + route_table_id = "rtb-02f587ef284db7a10"
      + subnet_id      = "subnet-0f13ea06e1444ffad"
    }

  # aws_route_table_association.rta_subnet_public will be updated in-place
  ~ resource "aws_route_table_association" "rta_subnet_public" {
        id             = "rtbassoc-006100b9f0e4bff3e"
      ~ route_table_id = "rtb-0be5c0eabf537b53a" -> (known after apply)
        subnet_id      = "subnet-00e90350bca1b0ff4"
    }

  # aws_vpc_endpoint.kms will be created
  + resource "aws_vpc_endpoint" "kms" {
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-00d9b79fcacc82970",
          + "sg-0babf07850f0bbeb5",
        ]
      + service_name          = "com.amazonaws.eu-west-2.kms"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-00e90350bca1b0ff4",
          + "subnet-0f13ea06e1444ffad",
        ]
      + tags                  = {
          + "Environment" = "PegaKMSDemo"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0a62c044ea3ac6c9b"
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ public_route_table_ids = [
      - "rtb-0be5c0eabf537b53a",
      + (known after apply),
    ]

Warning: Interpolation-only expressions are deprecated

  on ec2.tf line 8, in resource "aws_instance" "publicInstance1":
   8:   ami           = "${var.instance_ami}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 30 more similar warnings elsewhere)


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

 ```